### Read csv file:

In [1]:
import pandas as pd
salaries = pd.read_csv('salaries.csv', delimiter=';')

In [2]:
salaries.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

### Split dataframe into inputs and target:

In [3]:
inputs = salaries.drop('salary_more_then_100k', axis='columns')
target = salaries['salary_more_then_100k']

In [4]:
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [5]:
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

### Preprocess the input data:

In [6]:
from sklearn.preprocessing import LabelEncoder
encoder_company = LabelEncoder()
encoder_job = LabelEncoder()
encoder_degree = LabelEncoder()

In [8]:
inputs['company_e'] = encoder_company.fit_transform(inputs['company'])
inputs['job_e'] = encoder_job.fit_transform(inputs['job'])
inputs['degree_e'] = encoder_degree.fit_transform(inputs['degree'])

In [9]:
inputs.head()

  company                  job     degree  company_e  job_e  degree_e
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [10]:
inputs_enc = inputs.drop(['company', 'job', 'degree'], axis='columns')
inputs_enc.head()

   company_e  job_e  degree_e
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

### define and fit the decision tree model:

In [11]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [12]:
model.fit(inputs_enc, target)

DecisionTreeClassifier()

In [13]:
model.score(inputs_enc, target)

1.0

In [18]:
model.predict([[2,1,1]])

array([1])

### Same exercice with titanic dataset:

In [36]:
titanic = pd.read_csv('titanic.csv', delimiter=';')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [37]:
input_titanic = titanic.drop(['Survived', 'PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns')
input_titanic.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [38]:
target_titanic = titanic['Survived']
target_titanic.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [39]:
input_titanic.Sex = input_titanic.Sex.map({'male': 0, 'female': 1})
input_titanic.head()

   Pclass  Sex   Age     Fare
0       3    0  22.0   7.2500
1       1    1  38.0  71.2833
2       3    1  26.0   7.9250
3       1    1  35.0  53.1000
4       3    0  35.0   8.0500

In [40]:
input_titanic.Age.isnull().sum()

177

In [41]:
input_titanic.Age = input_titanic.Age.fillna(input_titanic.Age.mean())
input_titanic.Age.isnull().sum()

0

In [52]:
from sklearn.model_selection import train_test_split
train_X, test_X, train_Y, test_Y = train_test_split(input_titanic, target_titanic, test_size=0.2)

In [53]:
len(train_X)

712

In [54]:
len(test_X)

179

In [55]:
model_titanic = tree.DecisionTreeClassifier()

In [56]:
 model_titanic.fit(train_X, train_Y)

DecisionTreeClassifier()

In [57]:
model_titanic.score(test_X, test_Y)

0.7932960893854749

In [58]:
model_titanic.predict(test_X[:10])

array([0, 1, 1, 0, 0, 0, 1, 0, 0, 0])

In [59]:
test_Y[:10]

411    0
809    1
54     0
373    0
738    0
267    1
309    1
150    0
586    0
620    0
Name: Survived, dtype: int64